final-versions/numbered/V0.0/benchmarks/k6-full-result-vus-800-3-workers.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /k6_benchmark.js
        output: -

     scenarios: (100.00%) 1 scenario, 800 max VUs, 10m30s max duration (incl. graceful stop):
              * exact_requests: 25997 iterations shared among 800 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m00.8s), 800/800 VUs, 1136 complete and 0 interrupted iterations
exact_requests   [   4% ] 800 VUs  00m00.8s/10m0s  01136/25997 shared iters

running (00m01.8s), 800/800 VUs, 7504 complete and 0 interrupted iterations
exact_requests   [  29% ] 800 VUs  00m01.8s/10m0s  07504/25997 shared iters

running (00m02.8s), 800/800 VUs, 14361 complete and 0 interrupted iterations
exact_requests   [  55% ] 800 VUs  00m02.8s/10m0s  14361/25997 shared iters

running (00m03.8s), 800/800 VUs, 20146 complete and 0 interrupted iterations
exact_requests   [  77% ] 800 VUs  00m03.8s/10m0s  20146/25997 shared iters

running (00m04.8s), 234/800 VUs, 25763 complete and 0 interrupted iterations
exact_requests   [  99% ] 800 VUs  00m04.8s/10m0s  25763/25997 shared iters


  █ TOTAL RESULTS 

    checks_total.......: 103988 19353.260311/s
    checks_succeeded...: 25.00% 25997 out of 103988
    checks_failed......: 75.00% 77991 out of 103988

    ✗ Success (200 OK)
      ↳  76% — ✓ 20000 / ✗ 5997
    ✗ Duplicate ID (409 Conflict)
      ↳  0% — ✓ 0 / ✗ 25997
    ✗ Sold Out (410 Gone)
      ↳  23% — ✓ 5997 / ✗ 20000
    ✗ Gateway/DB Error (500+)
      ↳  0% — ✓ 0 / ✗ 25997

    HTTP
    http_req_duration..............: avg=126.48ms min=89.16ms  med=115.29ms max=867.35ms p(90)=142.43ms p(95)=163.28ms
      { expected_response:true }...: avg=122.18ms min=100.41ms med=117.07ms max=680.03ms p(90)=140.68ms p(95)=155.01ms
    http_req_failed................: 23.81% 6253 out of 26253
    http_reqs......................: 26253  4885.95937/s

    EXECUTION
    iteration_duration.............: avg=146.25ms min=89.27ms  med=115.75ms max=2.22s    p(90)=146.7ms  p(95)=176.44ms
    iterations.....................: 25997  4838.315078/s
    vus............................: 234    min=234           max=800
    vus_max........................: 800    min=800           max=800

    NETWORK
    data_received..................: 6.3 MB 1.2 MB/s
    data_sent......................: 2.8 MB 513 kB/s



running (00m05.4s), 000/800 VUs, 25997 complete and 0 interrupted iterations
exact_requests ✓ [ 100% ] 800 VUs  00m05.4s/10m0s  25997/25997 shared iters